app/Controllers/ComClassification.php

SELECT *
FROM `advrl`
ORDER BY `date_modified` DESC
---
    public function advanceRuiling()
    {
        $model = new ARuilingModel();
        $data['advrl'] = $model
        ->orderBy('date_modified', 'DESC')
        ->findAll();

SELECT *
FROM `intrl`
ORDER BY `issue_date` DESC
---
    public function internalRuiling()
    {
        $model = new IRuilingModel();
        $data['intrl'] = $model
        ->orderBy('issue_date', 'DESC')
        ->findAll();