app/Controllers/Publications.php

    public function departmentalOrders()
    {
        $model = new DoplModel();
        $data['dopl_files'] = $model
        ->orderBy('date', 'DESC')
        ->findAll();
---
SELECT *
FROM `dopl_files`
ORDER BY `date` DESC

    public function vcDecisions()
    {
        $model = new VcdsModel();

        $data['vcds_files'] = $model
          ->orderBy('date', 'DESC')
          ->findAll();
---
SELECT *
FROM `vcds_files`
ORDER BY `date` DESC

    public function lUploads()
{
    $model = new LUploadsModel();

    $data['legaluploads'] = $model
        ->orderBy('date', 'DESC')
        ->findAll();
---
SELECT *
FROM `legaluploads`
ORDER BY `date` DESC