app/Controllers/Templates.php

	public function cTemplates()
    {
        $model = new CTModel();
        $data['common_templates'] = $model
        ->orderBy('date', 'DESC')
        ->findAll();
---
SELECT *
FROM `common_templates`
ORDER BY `date` DESC