app/Controllers/Trainings.php

SELECT *
FROM `foreign_transfer_files`
ORDER BY `date` DESC
---
    public function fTrainings()
    {
        $model = new FTrainingsModel();
        $data['foreign_transfer_files'] = $model
        ->orderBy('date', 'DESC')
        ->findAll();