app/Controllers/Transfers.php

	public function ddcTransfers()
    {
        $model = new DDCTransfersModel();
        $data['ddc_transfer_files'] = $model
        ->orderBy('date', 'DESC')
        ->findAll();
---
SELECT *
FROM `ddc_transfer_files`
ORDER BY `date` DESC